benchmarks/vllm/runpod_h100sxm/Qwen3-8B/benchmaq-h100x8-sxm-perf_qwen3_8b_TP8_DP1_in2048_out128_p500_c100_9b2f41.txt
BENCHMARK: benchmaq-h100x8-sxm-perf_qwen3_8b_TP8_DP1_in2048_out128_p500_c100_9b2f41
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ad963bb1ee0>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=2048, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='/workspace/models/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./benchmarks/runpod_h100sxm/Qwen3-8B', result_filename='benchmaq-h100x8-sxm-perf_qwen3_8b_TP8_DP1_in2048_out128_p500_c100_9b2f41.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-9e3c6122-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 04-09 03:49:15 [datasets.py:612] Sampling input_len from [2048, 2048] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/500 [00:00<?, ?it/s]
  0%|          | 1/500 [00:02<17:40,  2.13s/it]
  0%|          | 2/500 [00:02<08:54,  1.07s/it]
  9%|▉         | 44/500 [00:02<00:15, 30.15it/s]
 11%|█▏        | 57/500 [00:02<00:12, 36.91it/s]
 14%|█▎        | 68/500 [00:02<00:10, 41.93it/s]
 16%|█▌        | 78/500 [00:03<00:08, 48.26it/s]
 17%|█▋        | 87/500 [00:03<00:07, 53.43it/s]
 19%|█▉        | 96/500 [00:03<00:07, 53.75it/s]
 21%|██        | 104/500 [00:04<00:23, 17.16it/s]
 28%|██▊       | 138/500 [00:04<00:09, 39.27it/s]
 30%|███       | 150/500 [00:05<00:07, 43.96it/s]
 32%|███▏      | 161/500 [00:05<00:06, 50.12it/s]
 34%|███▍      | 172/500 [00:05<00:06, 53.12it/s]
 36%|███▌      | 181/500 [00:05<00:05, 57.38it/s]
 38%|███▊      | 190/500 [00:05<00:05, 56.56it/s]
 40%|███▉      | 198/500 [00:05<00:05, 59.16it/s]
 41%|████      | 206/500 [00:07<00:15, 18.38it/s]
 48%|████▊     | 241/500 [00:07<00:06, 42.75it/s]
 51%|█████▏    | 257/500 [00:07<00:04, 53.32it/s]
 54%|█████▍    | 270/500 [00:07<00:04, 57.14it/s]
 56%|█████▌    | 281/500 [00:07<00:03, 58.92it/s]
 58%|█████▊    | 291/500 [00:07<00:03, 64.04it/s]
 60%|██████    | 301/500 [00:09<00:08, 23.60it/s]
 62%|██████▏   | 308/500 [00:09<00:08, 22.52it/s]
 66%|██████▌   | 329/500 [00:09<00:04, 37.36it/s]
 68%|██████▊   | 341/500 [00:09<00:03, 43.72it/s]
 70%|███████   | 350/500 [00:09<00:03, 48.18it/s]
 72%|███████▏  | 359/500 [00:09<00:02, 53.48it/s]
 74%|███████▎  | 368/500 [00:09<00:02, 58.25it/s]
 75%|███████▌  | 377/500 [00:10<00:02, 56.85it/s]
 77%|███████▋  | 385/500 [00:10<00:01, 59.57it/s]
 79%|███████▊  | 393/500 [00:10<00:01, 61.94it/s]
 80%|████████  | 401/500 [00:11<00:04, 23.30it/s]
 81%|████████▏ | 407/500 [00:11<00:04, 21.34it/s]
 94%|█████████▍| 472/500 [00:11<00:00, 86.69it/s]
100%|██████████| 500/500 [00:11<00:00, 42.41it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  11.79     
Total input tokens:                      1024000   
Total generated tokens:                  64000     
Request throughput (req/s):              42.41     
Output token throughput (tok/s):         5428.64   
Peak output token throughput (tok/s):    10708.00  
Peak concurrent requests:                199.00    
Total token throughput (tok/s):          92286.90  
---------------Time to First Token----------------
Mean TTFT (ms):                          558.35    
Median TTFT (ms):                        509.83    
P99 TTFT (ms):                           1558.33   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.04     
Median TPOT (ms):                        14.02     
P99 TPOT (ms):                           17.35     
---------------Inter-token Latency----------------
Mean ITL (ms):                           14.20     
Median ITL (ms):                         7.74      
P99 ITL (ms):                            60.41     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2341.34   
Median E2EL (ms):                        2309.74   
P99 E2EL (ms):                           3270.87   
==================================================