benchmarks/vllm/runpod_h100sxm/Qwen3-8B/qwen3_8b_TP4_DP2_in1024_out128_p1000_c50_f1ba91.txt
BENCHMARK: qwen3_8b_TP4_DP2_in1024_out128_p1000_c50_f1ba91
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x71b4077a4ea0>, seed=0, num_prompts=1000, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=50, model='/root/models/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./benchmarks/vllm/runpod_h100sxm/Qwen3-8B', result_filename='qwen3_8b_TP4_DP2_in1024_out128_p1000_c50_f1ba91.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-e0c9c0c4-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 04-10 08:48:46 [datasets.py:612] Sampling input_len from [1024, 1024] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 50

  0%|          | 0/1000 [00:00<?, ?it/s]
  0%|          | 1/1000 [00:00<15:03,  1.11it/s]
  4%|▎         | 37/1000 [00:01<00:19, 49.99it/s]
  6%|▌         | 59/1000 [00:01<00:27, 33.91it/s]
 10%|█         | 101/1000 [00:02<00:21, 42.76it/s]
 11%|█         | 111/1000 [00:02<00:19, 45.87it/s]
 15%|█▌        | 151/1000 [00:03<00:17, 48.82it/s]
 16%|█▌        | 159/1000 [00:03<00:17, 49.03it/s]
 20%|██        | 201/1000 [00:04<00:15, 52.57it/s]
 21%|██        | 208/1000 [00:04<00:15, 51.10it/s]
 25%|██▌       | 251/1000 [00:05<00:13, 54.07it/s]
 26%|██▌       | 257/1000 [00:05<00:14, 51.91it/s]
 30%|███       | 301/1000 [00:06<00:12, 55.09it/s]
 31%|███       | 307/1000 [00:06<00:13, 53.22it/s]
 35%|███▌      | 351/1000 [00:07<00:11, 55.01it/s]
 36%|███▌      | 357/1000 [00:07<00:11, 53.66it/s]
 40%|███▉      | 396/1000 [00:07<00:07, 80.75it/s]
 41%|████      | 407/1000 [00:08<00:12, 48.81it/s]
 45%|████▌     | 451/1000 [00:09<00:10, 52.43it/s]
 46%|████▌     | 459/1000 [00:09<00:10, 52.71it/s]
 50%|█████     | 501/1000 [00:09<00:09, 54.09it/s]
 51%|█████     | 508/1000 [00:10<00:09, 52.70it/s]
 55%|█████▌    | 551/1000 [00:10<00:08, 54.53it/s]
 56%|█████▌    | 557/1000 [00:10<00:08, 52.70it/s]
 60%|██████    | 601/1000 [00:11<00:07, 55.47it/s]
 61%|██████    | 607/1000 [00:11<00:07, 53.06it/s]
 65%|██████▌   | 651/1000 [00:12<00:06, 56.22it/s]
 66%|██████▌   | 657/1000 [00:12<00:06, 52.80it/s]
 70%|███████   | 701/1000 [00:13<00:05, 56.74it/s]
 71%|███████   | 707/1000 [00:13<00:05, 53.30it/s]
 75%|███████▍  | 748/1000 [00:13<00:02, 87.33it/s]
 76%|███████▋  | 764/1000 [00:14<00:04, 51.25it/s]
 80%|████████  | 801/1000 [00:15<00:03, 51.80it/s]
 81%|████████  | 811/1000 [00:15<00:03, 52.20it/s]
 85%|████████▌ | 851/1000 [00:16<00:02, 53.06it/s]
 86%|████████▌ | 859/1000 [00:16<00:02, 52.49it/s]
 90%|█████████ | 901/1000 [00:17<00:01, 54.44it/s]
 91%|█████████ | 908/1000 [00:17<00:01, 52.74it/s]
 95%|█████████▌| 951/1000 [00:18<00:00, 55.55it/s]
 96%|█████████▌| 957/1000 [00:18<00:00, 52.95it/s]
100%|██████████| 1000/1000 [00:18<00:00, 54.74it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1000      
Failed requests:                         0         
Maximum request concurrency:             50        
Benchmark duration (s):                  18.27     
Total input tokens:                      1024000   
Total generated tokens:                  128000    
Request throughput (req/s):              54.74     
Output token throughput (tok/s):         7007.17   
Peak output token throughput (tok/s):    7493.00   
Peak concurrent requests:                135.00    
Total token throughput (tok/s):          63064.55  
---------------Time to First Token----------------
Mean TTFT (ms):                          176.50    
Median TTFT (ms):                        179.25    
P99 TTFT (ms):                           333.94    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.77      
Median TPOT (ms):                        5.75      
P99 TPOT (ms):                           6.78      
---------------Inter-token Latency----------------
Mean ITL (ms):                           5.77      
Median ITL (ms):                         5.00      
P99 ITL (ms):                            35.97     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          909.77    
Median E2EL (ms):                        907.33    
P99 E2EL (ms):                           1003.60   
==================================================